% This file was created automatically from data.msk.
% DO NOT EDIT!
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Chapter{Data structures}

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Trees}

\>NumberOfVertex( <ver>, <deg> ) F

Let <ver> belong to $n$-th level of the <deg>-ary tree. One can
naturally enumerate all the vertices of this level by numbers $1,\ldots,<deg>^{<n>}$.
This function returns the number, which corresponds to the vertex <ver>.
\beginexample
gap> NumberOfVertex([1,2,1,2],2);
6
gap> NumberOfVertex("333",3);
27
\endexample


\>VertexNumber( <num>, <lev>, <deg> ) F

One can naturally enumerate all the vertices of the <lev>-th level of
the <deg>-ary tree by numbers $1,\ldots,<deg>^{<n>}$.
This function returns the vertex of this level, which has number <num>.
\beginexample
gap> VertexNumber(1,3,2);
[ 1, 1, 1 ]
gap> VertexNumber(4,4,3);
[ 1, 1, 2, 1 ]
\endexample



  how to construct all leaves of the finite tree

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Objects acting on trees}

\>TreeAutomorphism( <states>, <perm> ) O

Constructs a tree automorphism with states <states> and acting
on the first level as permutation <perm>.


\>Autom( <word>, <a> ) O
\>Autom( <word>, <fam> ) O


\>PermActionOnLevel( <perm>, <big_lev>, <sm_lev>, <deg> ) F

Given a permutation <perm> on the <big_lev>-th level of the tree of degree
<deg> returns the permutation induced by <perm> on a smaller level
<sm_lev>.
\beginexample
gap> PermActionOnLevel((1,4,2,3),2,1,2);
(1,2)
gap> PermActionOnLevel((1,13,5,9,3,15,7,11)(2,14,6,10,4,16,8,12),4,2,2);
(1,4,2,3)
\endexample


\>AutomFamily( <list>[, <names>] ) O
\>AutomFamilyNoBindGlobal( <list>[, <names>] ) O


\>AutomGroup( <automaton> ) O

Creates the self-similar group generated by finite automaton <automaton>
\beginexample
gap> A:=Automaton("a=(b,1)(1,2),b=(a,1)");
<automaton>
gap> G:=AutomGroup(A);
< a, b >
\endexample


\>AutomGroupNoBindGlobal( <automaton_list>[, <names>] ) O
\>AutomGroupNoBindGlobal( <string> ) O
\>AutomGroupNoBindGlobal( <automaton> ) O

These three do the same thing as AutomGroup, except they do not assign
generators of the group to variables.
\beginexample
gap> AutomGroupNoBindGlobal("t = (1, t)(1,2)");;
gap> t;
Variable: 't' must have a value

gap> AutomGroup("t = (1, t)(1,2)");;
gap> t;
t
\endexample


\>`IsTreeAutomorphismGroup'{IsTreeAutomorphismGroup}@{`IsTreeAutomorphismGroup'} C

Category of groups of tree automorphisms.


\>IsAutomGroup( <G> ) C

Whether group <G> is generated by elements from category IsAutom.


\>IsAutomatonGroup( <G> ) P

                          means that the group is generated by its automaton


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
