% This file was created automatically from data.msk.
% DO NOT EDIT!
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Chapter{Data structures}

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Trees}

\>NumberOfVertex( <ver>, <deg> ) F

Let <ver> belong to $n$-th level of the <deg>-ary tree. One can
naturally enumerate all the vertices of this level by numbers $1,\ldots,<deg>^{<n>}$.
This function returns the number, which corresponds to the vertex <ver>.
\beginexample
gap> NumberOfVertex([1,2,1,2],2);
6
gap> NumberOfVertex("333",3);
27
\endexample


\>VertexNumber( <num>, <lev>, <deg> ) F

One can naturally enumerate all the vertices of the <lev>-th level of
the <deg>-ary tree by numbers $1,\ldots,<deg>^{<n>}$.
This function returns the vertex of this level, which has number <num>.
\beginexample
gap> VertexNumber(1,3,2);
[ 1, 1, 1 ]
gap> VertexNumber(4,4,3);
[ 1, 1, 2, 1 ]
\endexample



  how to construct all leaves of the finite tree

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Objects acting on trees}

\>AutomGroup( <string> ) O
\>AutomGroup( <list>[, <names>] ) O
\>AutomGroup( <automaton> ) O

Creates the self-similar group generated by finite automaton, described by <string>
or <list>, or given as an argument <automaton>.

The <string> is a conventional notation of the form
`name1 = (name11, name12, ..., name1d)perm1, name2 = ...'
where each `name\*' is a name of state or `1', and each `perm\*' is a
permutation written in {\GAP} notation. Trivial permutations may be
omitted. This function ignores whitespace, and states may be separated
by commas or semicolons.

The <list> is a list consisting of `n' entries corresponding to `n' states of automaton.
Each entry is of the form $[a_1,\.\.\.,a_d,p]$,
where $d >= 2$ is the size of the alphabet the group acts on, $a_i$ are `IsInt' in `[1..m]' and
represent the sections of corresponding state at all vertices of the first level of the tree;
and all `p' is in `SymmetricalGroup(d)' describes the action of the corresponding state on the
alphabet.

Optional <names> must be a list of names of states in <automaton>.
These names are used to display elements of resulted group, and for
convenience it also binds variables with those names (see also~"AutomGroupNoBindGlobal").

\beginexample
gap> AutomGroup("a = (a, b), b = (a, b)(1,2)");
< a, b >
gap> AutomGroup("a=(b, a, 1)(2,3), b=(1, a, b)(1,2,3)");
< a, b >
gap> A:=Automaton("a=(b,1)(1,2),b=(a,1)");
<automaton>
gap> G:=AutomGroup(A);
< a, b >
\endexample


\>AutomGroupNoBindGlobal( <list>[, <names>] ) O
\>AutomGroupNoBindGlobal( <string> ) O
\>AutomGroupNoBindGlobal( <automaton> ) O

These three do the same thing as AutomGroup, except they do not assign
generators of the group to variables.
\beginexample
gap> AutomGroupNoBindGlobal("t = (1, t)(1,2)");;
gap> t;
Variable: 't' must have a value

gap> AutomGroup("t = (1, t)(1,2)");;
gap> t;
t
\endexample


\>AutomFamily( <list>[, <names>] ) O
\>AutomFamilyNoBindGlobal( <list>[, <names>] ) O


\>TreeAutomorphism( <states>, <perm> ) O

Constructs a tree automorphism with states <states> and acting
on the first level as permutation <perm>. The <states> must belong to the same family.
\beginexample
gap> G:=AutomGroup("a=(a,b)(1,2), b=(a,b)");
< a, b >
gap> c:=TreeAutomorphism([a,b,a,b^2],(1,2)(3,4));
(a, b, a, b^2)(1,2)(3,4)
gap> d:=TreeAutomorphism([b,1,a*b,b],(1,2));
(b, 1, a*b, b)(1,2)
gap> c*d;
(a, b^2, a*b, b^2*a*b)(3,4)
\endexample


\>Autom( <word>, <a> ) O
\>Autom( <word>, <fam> ) O

Given assosiative word <word> constructs a tree automorphism from the family
<fam>, or to whiich automorphism <a> belonds. This function is useful when
one needs to make same operations with associative words.
\beginexample
gap> G:=AutomGroup("a=(a,b)(1,2), b=(a,b)");
< a, b >
gap> F:=UnderlyingFreeGroup(G);
<free group on the generators [ a, b ]>
gap> c:=Autom(F.1*F.2^2,a);
a*b^2
gap> IsAutom(c);
true
\endexample


\>PermActionOnLevel( <perm>, <big_lev>, <sm_lev>, <deg> ) F

Given a permutation <perm> on the <big_lev>-th level of the tree of degree
<deg> returns the permutation induced by <perm> on a smaller level
<sm_lev>.
\beginexample
gap> PermActionOnLevel((1,4,2,3),2,1,2);
(1,2)
gap> PermActionOnLevel((1,13,5,9,3,15,7,11)(2,14,6,10,4,16,8,12),4,2,2);
(1,4,2,3)
\endexample


\>`IsTreeAutomorphismGroup'{IsTreeAutomorphismGroup}@{`IsTreeAutomorphismGroup'} C

The category of groups of tree automorphisms.


\>`IsAutomGroup'{IsAutomGroup}@{`IsAutomGroup'} C

The category of groups generated by finite invertible initial automata
(elements from category `IsAutom').


\>IsAutomatonGroup( <G> ) P

                          means that the group is generated by its automaton


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
